DataProcessors/ПлатежныйКалендарьПоАренде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПлатежныйКалендарьПоАренде</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНеоплаченные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросроченные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВалютные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоМинусоваяЭффективность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧДоговоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьНепроведенныйПлатеж</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьРасчетыВВалюте</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МенеджерПоАренде</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежаНет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежныйДокумент</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежПросрочен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокОплатыАренды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыОплатыДоговоровКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАренднойПлаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыАренднойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧислоОплатыАренды</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоХвостОплаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эффективность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыДоговоровАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДоговоровАренды</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.РасторжениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключениеДоговора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокУведомленияОПерезаключении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыРасчетаКурсаВалюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаКурсаВалюты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КурсЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фиксированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаДвухКурсовВалютДеленнаяПололам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПлатежныйКалендарьПоАренде/Ext/ObjectModule.bsl
Перем мВалютаРегл Экспорт;

Функция ПолучитьРезультатЗапроса() 
	перем ПараметрыЗапроса;
	//+++АК VERN 2016.08.19 ИП-00013332.001.00000001 
	//код вынесен в модуль менеджера для совместного использования в обработке "Платежный календарь"
	
	ПараметрыЗапроса=Обработки.ПлатежныйКалендарьПоАренде.ПолучитьСтруктуруПараметровЗапроса();
	
	ПараметрыЗапроса.Организация				=	Организация;
	ПараметрыЗапроса.Контрагент					=	Контрагент;
	ПараметрыЗапроса.СтруктурнаяЕдиница			=	СтруктурнаяЕдиница;
	ПараметрыЗапроса.ФормаОплаты				=	ФормаОплаты;
	ПараметрыЗапроса.ВалютаРегл					=	мВалютаРегл;
	
	ПараметрыЗапроса.МесяцПлатежногоКалендаря	=	НачалоМесяца(НачалоПериода);
	
	Возврат Обработки.ПлатежныйКалендарьПоАренде.ПолучитьРезультатЗапроса(ПараметрыЗапроса);
	
	//---АК VERN 2016.08.19 ИП-00013332.001.00000001 
	
	
	
КонецФункции

Функция ПолучитьРезультатТаблицу() Экспорт 
	
	РезультатЗапроса = ПолучитьРезультатЗапроса();
	
	ТаблицаРезультат = РезультатЗапроса.Выгрузить().СкопироватьКолонки();
	ТаблицаРезультат.Колонки.Добавить("ЕстьРасчетыВВалюте", Новый ОписаниеТипов("Булево"));
	
	ВыборкаДоговоры = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДоговоры.Следующий() Цикл
		
		ВыборкаФормыОплаты = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаФормыОплаты.Следующий() Цикл
			
			ВыборкаТипАренднойПлаты = ВыборкаФормыОплаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаТипАренднойПлаты.Следующий() Цикл
				
				ВыборкаМесяцАренды = ВыборкаТипАренднойПлаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаМесяцАренды.Следующий() Цикл
					//+++ AK suvv 14.06.2018 ИП-00018763
					
					//НСтрока = ТаблицаРезультат.Добавить();
					//ЗаполнитьЗначенияСвойств(НСтрока, ВыборкаМесяцАренды);
					//
					//Сумма = 0;
					//Выборка = ВыборкаМесяцАренды.Выбрать();
					
					ВыборкаАванс = ВыборкаМесяцАренды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаАванс.Следующий() Цикл 
						
						//+++АК LAGP 2018.11.07 ИП-00020021 Добавлен менеджер по аренде
						ВыборкаМенеджерПоАренде = ВыборкаАванс.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаМенеджерПоАренде.Следующий() Цикл
							НСтрока = ТаблицаРезультат.Добавить();
							//ЗаполнитьЗначенияСвойств(НСтрока, ВыборкаАванс);
							ЗаполнитьЗначенияСвойств(НСтрока, ВыборкаМенеджерПоАренде);
							
							
							Сумма = 0;
							Аванс = ВыборкаАванс.Аванс;
							
							Выборка = ВыборкаМенеджерПоАренде.Выбрать();
							//НСтрока.МенеджерПоАренде = ВыборкаМенеджерПоАренде.МенеджерПоАренде;								
						//---АК LAGP
						
						//НСтрока = ТаблицаРезультат.Добавить();
						//ЗаполнитьЗначенияСвойств(НСтрока, ВыборкаАванс);
						//
						//Сумма = 0;
						//Аванс = ВыборкаАванс.Аванс;
						
						//--- AK suvv
						
						//+++АК LAGP 2018.11.07 ИП-00020021 Добавлен менеджер по аренде
						//Пока ВыборкаМенеджерПоАренде.Следующий() Цикл
						//	Выборка = ВыборкаМенеджерПоАренде.Выбрать();
						//	НСтрока.МенеджерПоАренде = ВыборкаМенеджерПоАренде.МенеджерПоАренде;								
						//---АК LAGP
							
							Пока Выборка.Следующий()  Цикл								
								
								Если Выборка.ВалютаСтрока = мВалютаРегл Тогда
									Сумма = Сумма + Выборка.Сумма; 
									
								ИначеЕсли ЗначениеЗаполнено(Выборка.ВалютаСтрока) Тогда
									КурсВалюты =  РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Выборка.ДатаОплаты, Новый Структура("Валюта", Выборка.ВалютаСтрока)).Курс;
									Сумма = Сумма + Выборка.СуммаВал*КурсВалюты; 
									НСтрока.ЕстьРасчетыВВалюте = Истина;
									
								ИначеЕсли Выборка.Валюта = мВалютаРегл И (Выборка.СпособРасчета = Перечисления.СпособыРасчетаКурсаВалюты.КурсЦБ ИЛИ Выборка.СпособРасчета = Перечисления.СпособыРасчетаКурсаВалюты.ПустаяСсылка()) Тогда
									Сумма = Сумма + Выборка.Сумма; 
									
								Иначе
									КурсВалюты = ПроцедурыНачисления.ПолучитьКурсВалютыПоДоговору(Выборка.ДатаОплаты, Выборка).Курс;	
									Сумма = Сумма + Выборка.СуммаВал*КурсВалюты; 
									НСтрока.ЕстьРасчетыВВалюте = Истина;
									
								КонецЕсли;
								
							КонецЦикла; 
						КонецЦикла;	
						
						НСтрока.Сумма = Сумма;
						
						//+++ AK suvv 14.06.2018 ИП-00018763
						НСтрока.Аванс = Аванс;
					КонецЦикла;
					//--- AK suvv
				КонецЦикла; 
				
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
	// Добавляем эффективность
	ТаблицаРезультат.Колонки.Добавить("Эффективность", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	
	ADOСоединение = ВнешниеДанные.ПолучитьADOСоединение("10.0.0.40");
	
	Если ADOСоединение = Неопределено Тогда
		Возврат ТаблицаРезультат;
	КонецЕсли;
	
	КонецПериодаАнализа = НачалоДня(ТекущаяДата()) - 1;
	НачалоПериодаАнализа = НачалоДня(КонецПериодаАнализа - 6*24*60*60);
	
	ТекстЗапросаSQL = "SELECT CAST(TTBin2UID.UID as nvarchar(50)) TTUid, 
	|	  SUM(olap.Эффективность) Эффективность
	|  FROM [OLAP].[dbo].[olap_v] (nolock) as olap
	|  LEFT OUTER JOIN IzbenkaFin.dbo.TTBin2UID as TTBin2UID
	|	ON olap.id_tt = TTBin2UID.id_tt
	|WHERE olap.date >= " + ВнешниеДанные.ФорматПоля(НачалоПериодаАнализа) + " and olap.date <= " + ВнешниеДанные.ФорматПоля(КонецПериодаАнализа) + "
	|GROUP BY
	|CAST(TTBin2UID.UID as nvarchar(50))";
	
	ТабСЭффективностью = Новый ТаблицаЗначений();
	ТабСЭффективностью.Колонки.Добавить("ТорговаяТочка", Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы"));
	ТабСЭффективностью.Колонки.Добавить("Эффективность", Новый ОписаниеТипов("Число"));
	
	rs = ADOСоединение.Execute(ТекстЗапросаSQL);
	Попытка
		rs.MoveFirst();
		Пока НЕ rs.Eof() Цикл
			НовСтр = ТабСЭффективностью.Добавить();
			НовСтр.ТорговаяТочка = Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(Новый УникальныйИдентификатор(rs.Fields("TTUid").Value));
			НовСтр.Эффективность = rs.Fields("Эффективность").Value;
			
			rs.MoveNext();
		КонецЦикла;
		
	Исключение
	КонецПопытки;
	
	ADOСоединение.Close();
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		СтрокаТТ = ТабСЭффективностью.Найти(Строка.СтруктурнаяЕдиница);
		Если СтрокаТТ<>Неопределено Тогда
			Строка.Эффективность = СтрокаТТ.Эффективность;
		КонецЕсли; 
	КонецЦикла;  
	
	//
	Возврат ТаблицаРезультат;
	
КонецФункции



Функция ПолучитьРезультатЗапросаСтарыйВариант() 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода"		, НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"		, КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоСледПериода"	, ДобавитьМесяц(НачалоПериода, 1));
	Запрос.УстановитьПараметр("КонецСледПериода"	, КонецМесяца(ДобавитьМесяц(КонецПериода, 1)));
	Запрос.УстановитьПараметр("Организация"			, Организация);
	Запрос.УстановитьПараметр("Контрагент"			, Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТекущаяДата"			, НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ФормаОплаты"			, ФормаОплаты);
	Запрос.УстановитьПараметр("ВидПериода"			, ВидПериода);
	Запрос.УстановитьПараметр("ДатаОтчета"			, ДатаОтчета);
	Запрос.УстановитьПараметр("ВалютаРегл"			, мВалютаРегл);
	Запрос.УстановитьПараметр("Руб"					, Справочники.Валюты.НайтиПоНаименованию("RUB"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря,
	|	СтатусыДоговоровАренды.Договор КАК ДоговорКонтрагента,
	|	МАКСИМУМ(СтатусыДоговоровАренды.Период) КАК Период
	|ПОМЕСТИТЬ ВТПроизводственныйКалендарь
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДоговоровАренды КАК СтатусыДоговоровАренды
	|		ПО (СтатусыДоговоровАренды.Период <= РегламентированныйПроизводственныйКалендарь.ДатаКалендаря)
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &НачалоПериода
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &КонецПериода
	|	И (СтатусыДоговоровАренды.Договор.Организация = &Организация
	|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И (СтатусыДоговоровАренды.Договор.Владелец = &Контрагент
	|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|	И (СтатусыДоговоровАренды.Договор.ОбъектАренды.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|	И СтатусыДоговоровАренды.ЗаключениеДоговора.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговоровАренды.САрендодателем)
	|	И НЕ СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ НАЧАЛОПЕРИОДА(СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта, МЕСЯЦ) > &НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	|	СтатусыДоговоровАренды.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыДоговоровАренды.Договор.Организация КАК Организация,
	|	СтатусыДоговоровАренды.Договор.Владелец КАК Контрагент,
	|	СтатусыДоговоровАренды.Договор КАК ДоговорКонтрагента,
	|	СтатусыДоговоровАренды.Договор.ОбъектАренды.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ СтатусыДоговоровАренды.ДатаНачалаАренды > СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта
	|			ТОГДА СтатусыДоговоровАренды.ДатаНачалаАренды
	|		ИНАЧЕ СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта
	|	КОНЕЦ КАК ДатаНачалаАренды,
	|	СтатусыДоговоровАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта КАК ДатаАктаЗаключения,
	|	ВЫБОР
	|		КОГДА СтатусыДоговоровАренды.Регистратор ССЫЛКА Документ.РасторжениеДоговораАренды
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоговорРасторгнут,
	|	МАКСИМУМ(РегламентированныйПроизводственныйКалендарь2.ДатаКалендаря) КАК ДатаОплаты
	|ПОМЕСТИТЬ ВТ_Статусы
	|ИЗ
	|	ВТПроизводственныйКалендарь КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДоговоровАренды КАК СтатусыДоговоровАренды
	|		ПО ВложенныйЗапрос.ДоговорКонтрагента = СтатусыДоговоровАренды.Договор
	|			И ВложенныйЗапрос.Период = СтатусыДоговоровАренды.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь2
	|		ПО (РегламентированныйПроизводственныйКалендарь2.ДатаКалендаря <= ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, ВложенныйЗапрос.ДоговорКонтрагента.ЧислоОплатыАренды - 1))
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь2.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|	И РегламентированныйПроизводственныйКалендарь2.ДатаКалендаря <= ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 1)
	|	И ВложенныйЗапрос.ДатаКалендаря = НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыДоговоровАренды.Договор.Организация,
	|	СтатусыДоговоровАренды.Договор.Владелец,
	|	СтатусыДоговоровАренды.Договор,
	|	СтатусыДоговоровАренды.Договор.ОбъектАренды.СтруктурнаяЕдиница,
	|	СтатусыДоговоровАренды.ДатаНачалаАренды,
	|	СтатусыДоговоровАренды.ДатаОкончанияАренды,
	|	СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта,
	|	ВЫБОР
	|		КОГДА СтатусыДоговоровАренды.Регистратор ССЫЛКА Документ.РасторжениеДоговораАренды
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
	|ПОМЕСТИТЬ ВТ_ПервыйРабочийДень
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &НачалоПериода
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	ВложенныйЗапрос.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	ВложенныйЗапрос.ДатаАктаЗаключения КАК ДатаАктаЗаключения,
	|	ВложенныйЗапрос.ДоговорРасторгнут КАК ДоговорРасторгнут,
	|	ВЫБОР
	|		КОГДА НЕ ДатыОплатыПоДоговорамАренды.Дата ЕСТЬ NULL 
	|			ТОГДА ДатыОплатыПоДоговорамАренды.Дата
	|		КОГДА МЕСЯЦ(ВложенныйЗапрос.ДатаОплаты) < МЕСЯЦ(&НачалоПериода)
	|			ТОГДА ВТ_ПервыйРабочийДень.ДатаКалендаря
	|		ИНАЧЕ ВложенныйЗапрос.ДатаОплаты
	|	КОНЕЦ КАК ДатаОплаты,
	|	ВложенныйЗапрос2.ТипАренднойПлаты КАК ТипАренднойПлаты,
	|	ВложенныйЗапрос2.ФормаОплаты КАК ФормаОплаты,
	|	ВЫБОР
	|		КОГДА СтатусыОплатыПоДоговорамАрендыСрезПоследних.Статус ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОплатыДоговоровКонтрагентов.Действует)
	|		ИНАЧЕ СтатусыОплатыПоДоговорамАрендыСрезПоследних.Статус
	|	КОНЕЦ КАК СтатусОплаты
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	ВТ_ПервыйРабочийДень КАК ВТ_ПервыйРабочийДень,
	|	ВТ_Статусы КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыОплатыПоДоговорамАренды КАК ДатыОплатыПоДоговорамАренды
	|		ПО ВложенныйЗапрос.ДоговорКонтрагента = ДатыОплатыПоДоговорамАренды.Договор
	|			И (ДатыОплатыПоДоговорамАренды.ПериодРегистрации = &НачалоПериода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОплатыПоДоговорамАренды.СрезПоследних(&КонецПериода, ) КАК СтатусыОплатыПоДоговорамАрендыСрезПоследних
	|		ПО ВложенныйЗапрос.ДоговорКонтрагента = СтатусыОплатыПоДоговорамАрендыСрезПоследних.Договор,
	|	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть) КАК ТипАренднойПлаты,
	|		ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные) КАК ФормаОплаты
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть),
	|		ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть),
	|		ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть),
	|		ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)) КАК ВложенныйЗапрос2
	|ГДЕ
	|	ВЫБОР
	|			КОГДА МЕСЯЦ(ВложенныйЗапрос.ДатаОплаты) < МЕСЯЦ(&НачалоПериода)
	|				ТОГДА ВТ_ПервыйРабочийДень.ДатаКалендаря
	|			ИНАЧЕ ВложенныйЗапрос.ДатаОплаты
	|		КОНЕЦ >= &НачалоПериода
	|	И ВЫБОР
	|			КОГДА МЕСЯЦ(ВложенныйЗапрос.ДатаОплаты) < МЕСЯЦ(&НачалоПериода)
	|				ТОГДА ВТ_ПервыйРабочийДень.ДатаКалендаря
	|			ИНАЧЕ ВложенныйЗапрос.ДатаОплаты
	|		КОНЕЦ <= &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланируемыеПлатежиПоДоговорамАренды.Договор КАК ДоговорКонтрагента,
	|	ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|	ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты,
	|	СУММА(ПланируемыеПлатежиПоДоговорамАренды.Сумма) КАК СуммаПлан,
	|	СУММА(ПланируемыеПлатежиПоДоговорамАренды.СуммаВал) КАК СуммаПланВал
	|ПОМЕСТИТЬ ВТ_ПланируемыеПлатежи
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды КАК ПланируемыеПлатежиПоДоговорамАренды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МАКСИМУМ(ПланируемыеПлатежиПоДоговорамАренды.Период) КАК Период,
	|				ПланируемыеПлатежиПоДоговорамАренды.Договор КАК Договор,
	|				ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты КАК ФормаОплаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты КАК ТипАренднойПлаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.Дата КАК Дата
	|			ИЗ
	|				РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды КАК ПланируемыеПлатежиПоДоговорамАренды
	|			ГДЕ
	|				ПланируемыеПлатежиПоДоговорамАренды.Период <= &КонецПериода
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ПланируемыеПлатежиПоДоговорамАренды.Договор,
	|				ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.Дата) КАК Периоды
	|			ПО ПланируемыеПлатежиПоДоговорамАренды.Период = Периоды.Период
	|				И ПланируемыеПлатежиПоДоговорамАренды.Договор = Периоды.Договор
	|				И ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты = Периоды.ФормаОплаты
	|				И ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты = Периоды.ТипАренднойПлаты
	|				И ПланируемыеПлатежиПоДоговорамАренды.Дата = Периоды.Дата
	|		ПО ВТ_Договоры.ДоговорКонтрагента = ПланируемыеПлатежиПоДоговорамАренды.Договор
	|			И ВТ_Договоры.ФормаОплаты = ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты
	|			И ВТ_Договоры.ТипАренднойПлаты = ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты
	|ГДЕ
	|	ПланируемыеПлатежиПоДоговорамАренды.Период <= &КонецПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата >= &НачалоПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата <= &КонецПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата >= ВТ_Договоры.ДатаНачалаАренды
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата <= ВЫБОР
	|			КОГДА ВТ_Договоры.ДоговорРасторгнут
	|				ТОГДА ВТ_Договоры.ДатаОкончанияАренды
	|			ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_Договоры.ДатаОкончанияАренды, МЕСЯЦ, 6), МЕСЯЦ)
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланируемыеПлатежиПоДоговорамАренды.Договор,
	|	ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|	ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланируемыеПлатежиПоДоговорамАренды.Договор КАК ДоговорКонтрагента,
	|	ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|	ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты,
	|	СУММА(ПланируемыеПлатежиПоДоговорамАренды.Сумма) КАК СуммаПлан,
	|	СУММА(ПланируемыеПлатежиПоДоговорамАренды.СуммаВал) КАК СуммаПланВал
	|ПОМЕСТИТЬ ВТ_ПланируемыеПлатежи_СледующийПериод
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды КАК ПланируемыеПлатежиПоДоговорамАренды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МАКСИМУМ(ПланируемыеПлатежиПоДоговорамАренды.Период) КАК Период,
	|				ПланируемыеПлатежиПоДоговорамАренды.Договор КАК Договор,
	|				ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты КАК ФормаОплаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты КАК ТипАренднойПлаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.Дата КАК Дата
	|			ИЗ
	|				РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды КАК ПланируемыеПлатежиПоДоговорамАренды
	|			ГДЕ
	|				ПланируемыеПлатежиПоДоговорамАренды.Период <= &КонецСледПериода
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ПланируемыеПлатежиПоДоговорамАренды.Договор,
	|				ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.Дата) КАК Периоды
	|			ПО ПланируемыеПлатежиПоДоговорамАренды.Период = Периоды.Период
	|				И ПланируемыеПлатежиПоДоговорамАренды.Договор = Периоды.Договор
	|				И ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты = Периоды.ФормаОплаты
	|				И ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты = Периоды.ТипАренднойПлаты
	|				И ПланируемыеПлатежиПоДоговорамАренды.Дата = Периоды.Дата
	|		ПО ВТ_Договоры.ДоговорКонтрагента = ПланируемыеПлатежиПоДоговорамАренды.Договор
	|			И ВТ_Договоры.ФормаОплаты = ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты
	|			И ВТ_Договоры.ТипАренднойПлаты = ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты
	|ГДЕ
	|	ПланируемыеПлатежиПоДоговорамАренды.Период <= &КонецСледПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата >= &НачалоСледПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата <= &КонецСледПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата >= ВТ_Договоры.ДатаНачалаАренды
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата <= ВЫБОР
	|			КОГДА ВТ_Договоры.ДоговорРасторгнут
	|				ТОГДА ВТ_Договоры.ДатаОкончанияАренды
	|			ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_Договоры.ДатаОкончанияАренды, МЕСЯЦ, 6), МЕСЯЦ)
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланируемыеПлатежиПоДоговорамАренды.Договор,
	|	ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|	ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходИзБанка.Организация КАК Организация,
	|	РасходИзБанка.Контрагент КАК Контрагент,
	|	РасходИзБанка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НАЧАЛОПЕРИОДА(РасходИзБанка.Ссылка.Дата, ДЕНЬ) КАК Дата,
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные) КАК ФормаОплаты,
	|	ВЫБОР
	|		КОГДА РасходИзБанка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПостояннойЧастиАрендыАрендодателю)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть)
	|	КОНЕЦ КАК ТипАренднойПлаты,
	|	РасходИзБанка.Ссылка КАК ПлатежныйДокумент
	|ПОМЕСТИТЬ ВТДокументыРасхода
	|ИЗ
	|	Документ.РасходИзБанка КАК РасходИзБанка
	|ГДЕ
	|	РасходИзБанка.Проведен
	|	И РасходИзБанка.Дата >= &НачалоПериода
	|	И РасходИзБанка.Дата <= ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
	|	И (РасходИзБанка.Организация = &Организация
	|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И (РасходИзБанка.Контрагент = &Контрагент
	|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|	И РасходИзБанка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПостояннойЧастиАрендыАрендодателю), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПеременнойЧастиАрендыАрендодателю))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	РасходИзКассы.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные),
	|	ВЫБОР
	|		КОГДА РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПостояннойЧастиАрендыАрендодателю)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть)
	|	КОНЕЦ,
	|	РасходИзКассы.Ссылка
	|ИЗ
	|	Документ.РасходИзКассы КАК РасходИзКассы
	|ГДЕ
	|	РасходИзКассы.Проведен
	|	И РасходИзКассы.Дата >= &НачалоПериода
	|	И РасходИзКассы.Дата <= ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
	|	И (РасходИзКассы.Организация = &Организация
	|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И (РасходИзКассы.Контрагент = &Контрагент
	|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|	И РасходИзКассы.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПостояннойЧастиАрендыАрендодателю), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПеременнойЧастиАрендыАрендодателю))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договоры.Организация КАК Организация,
	|	ВТ_Договоры.Контрагент КАК Контрагент,
	|	ВТ_Договоры.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_Договоры.ДоговорКонтрагента.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_Договоры.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_Договоры.ДатаНачалаАренды,
	|	ВТ_Договоры.ДатаОкончанияАренды,
	|	ВТ_Договоры.ДатаАктаЗаключения,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|							ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПлан, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПлан, 0)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПланБезналичные,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|							ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПланВал, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПланВал, 0)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПланБезналичныеВал,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|							ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПлан, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПлан, 0)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПланНаличные,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|							ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПланВал, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПланВал, 0)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПланНаличныеВал,
	|	ВТ_Договоры.ДатаОплаты КАК ДатаОплаты,
	|	ВТ_Договоры.ДоговорКонтрагента.Комментарий КАК Комментарий,
	|	ВТ_Договоры.ДоговорКонтрагента.ЧислоОплатыАренды КАК ЧислоОплатыАренды,
	|	ВТ_Договоры.ДоговорКонтрагента.СрокОплатыАренды КАК СрокОплатыАренды,
	|	ВТ_Договоры.СтатусОплаты,
	|	ВТ_Договоры.ТипАренднойПлаты КАК ТипАренднойПлаты,
	|	ВЫБОР
	|		КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|			ТОГДА Документы.ПлатежныйДокумент
	|		ИНАЧЕ Документы.ПлатежныйДокумент
	|	КОНЕЦ КАК ПлатежныйДокумент,
	|	ВЫБОР
	|		КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|				И НЕ Документы.Дата ЕСТЬ NULL 
	|				И ДОБАВИТЬКДАТЕ(ВТ_Договоры.ДатаОплаты, ДЕНЬ, 1) = Документы.Дата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоХвостОплаты
	|ПОМЕСТИТЬ ВТ_СводныеДанные
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПланируемыеПлатежи КАК ВТ_ПланируемыеПлатежи
	|		ПО ВТ_Договоры.ДоговорКонтрагента = ВТ_ПланируемыеПлатежи.ДоговорКонтрагента
	|			И ВТ_Договоры.ФормаОплаты = ВТ_ПланируемыеПлатежи.ФормаОплаты
	|			И ВТ_Договоры.ТипАренднойПлаты = ВТ_ПланируемыеПлатежи.ТипАренднойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПланируемыеПлатежи_СледующийПериод КАК ВТ_ПланируемыеПлатежи_СледующийПериод
	|		ПО ВТ_Договоры.ДоговорКонтрагента = ВТ_ПланируемыеПлатежи_СледующийПериод.ДоговорКонтрагента
	|			И ВТ_Договоры.ФормаОплаты = ВТ_ПланируемыеПлатежи_СледующийПериод.ФормаОплаты
	|			И ВТ_Договоры.ТипАренднойПлаты = ВТ_ПланируемыеПлатежи_СледующийПериод.ТипАренднойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасхода КАК Документы
	|		ПО ВТ_Договоры.Организация = Документы.Организация
	|			И ВТ_Договоры.Контрагент = Документы.Контрагент
	|			И ВТ_Договоры.ДоговорКонтрагента = Документы.ДоговорКонтрагента
	|			И (ВТ_Договоры.ДатаОплаты = Документы.Дата
	|				ИЛИ ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|					И ДОБАВИТЬКДАТЕ(ВТ_Договоры.ДатаОплаты, ДЕНЬ, 1) = Документы.Дата)
	|			И ВТ_Договоры.ФормаОплаты = Документы.ФормаОплаты
	|			И ВТ_Договоры.ТипАренднойПлаты = Документы.ТипАренднойПлаты
	|ГДЕ
	|	(ВТ_Договоры.ФормаОплаты = &ФормаОплаты
	|			ИЛИ &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПустаяСсылка)
	|				И ВЫБОР
	|					КОГДА НЕ &ВидПериода
	|							И ВТ_Договоры.ДатаОплаты = &ДатаОтчета
	|						ТОГДА 1
	|					КОГДА &ВидПериода
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ = 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Договоры.ДоговорКонтрагента,
	|	ВТ_Договоры.Организация,
	|	ВТ_Договоры.Контрагент,
	|	ВТ_Договоры.СтруктурнаяЕдиница,
	|	ВТ_Договоры.ДатаНачалаАренды,
	|	ВТ_Договоры.ДатаОкончанияАренды,
	|	ВТ_Договоры.ДатаАктаЗаключения,
	|	ВТ_Договоры.ДоговорКонтрагента.СтавкаНДС,
	|	ВТ_Договоры.ДатаОплаты,
	|	ВТ_Договоры.ДоговорКонтрагента.Комментарий,
	|	ВТ_Договоры.ДоговорКонтрагента.ЧислоОплатыАренды,
	|	ВТ_Договоры.ДоговорКонтрагента.СрокОплатыАренды,
	|	ВТ_Договоры.СтатусОплаты,
	|	ВТ_Договоры.ТипАренднойПлаты,
	|	Документы.ПлатежныйДокумент,
	|	ВЫБОР
	|		КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|			ТОГДА Документы.ПлатежныйДокумент
	|		ИНАЧЕ Документы.ПлатежныйДокумент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|				И НЕ Документы.Дата ЕСТЬ NULL 
	|				И ДОБАВИТЬКДАТЕ(ВТ_Договоры.ДатаОплаты, ДЕНЬ, 1) = Документы.Дата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВЫБОР
	|				КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|								ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПлан, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПлан, 0)
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|								ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПланВал, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПланВал, 0)
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|								ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПлан, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПлан, 0)
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|								ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПланВал, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПланВал, 0)
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.ДоговорКонтрагента,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.ДатаНачалаАренды,
	|	ВложенныйЗапрос.ДатаОкончанияАренды,
	|	ВложенныйЗапрос.ДатаАктаЗаключения,
	|	ВложенныйЗапрос.СуммаПланБезналичные,
	|	ВЫБОР
	|		КОГДА КурсыВалютДляРасчетовПоАренде.Валюта = &ВалютаРегл
	|					И КурсыВалютДляРасчетовПоАренде.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.КурсЦБ)
	|				ИЛИ ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.СпособРасчета, ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.ПустаяСсылка)
	|			ТОГДА ВложенныйЗапрос.СуммаПланБезналичные
	|		ИНАЧЕ ВложенныйЗапрос.СуммаПланБезналичныеВал
	|	КОНЕЦ КАК СуммаПланБезналичныеВал,
	|	ВложенныйЗапрос.СуммаПланНаличные,
	|	ВЫБОР
	|		КОГДА КурсыВалютДляРасчетовПоАренде.Валюта = &ВалютаРегл
	|				И КурсыВалютДляРасчетовПоАренде.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.КурсЦБ)
	|			ТОГДА ВложенныйЗапрос.СуммаПланНаличные
	|		ИНАЧЕ ВложенныйЗапрос.СуммаПланНаличныеВал
	|	КОНЕЦ КАК СуммаПланНаличныеВал,
	|	ВложенныйЗапрос.ДатаОплаты,
	|	ВложенныйЗапрос.Комментарий,
	|	ВложенныйЗапрос.ЧислоОплатыАренды,
	|	ВложенныйЗапрос.СрокОплатыАренды,
	|	ВложенныйЗапрос.СтатусОплаты,
	|	ВложенныйЗапрос.ТипАренднойПлаты,
	|	ВложенныйЗапрос.ПлатежныйДокумент,
	|	ВложенныйЗапрос.ЭтоХвостОплаты,
	|	ВложенныйЗапрос.Период,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Валюта, &Руб) КАК Валюта,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Валюта2, &Руб) КАК Валюта2,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Курс, 1) КАК Курс,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Кратность, &Руб) КАК Кратность,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.СпособРасчета, ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.ПустаяСсылка)) КАК СпособРасчета,
	|	КурсыВалютДляРасчетовПоАренде.Коэффициент,
	|	КурсыВалютДляРасчетовПоАренде.НижняяГраница,
	|	КурсыВалютДляРасчетовПоАренде.ВерхняяГраница
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_СводныеДанные.Организация КАК Организация,
	|		ВТ_СводныеДанные.Контрагент КАК Контрагент,
	|		ВТ_СводныеДанные.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		ВТ_СводныеДанные.СтавкаНДС КАК СтавкаНДС,
	|		ВТ_СводныеДанные.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ВТ_СводныеДанные.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|		ВТ_СводныеДанные.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|		ВТ_СводныеДанные.ДатаАктаЗаключения КАК ДатаАктаЗаключения,
	|		ВТ_СводныеДанные.СуммаПланБезналичные КАК СуммаПланБезналичные,
	|		ВТ_СводныеДанные.СуммаПланБезналичныеВал КАК СуммаПланБезналичныеВал,
	|		ВТ_СводныеДанные.СуммаПланНаличные КАК СуммаПланНаличные,
	|		ВТ_СводныеДанные.СуммаПланНаличныеВал КАК СуммаПланНаличныеВал,
	|		ВТ_СводныеДанные.ДатаОплаты КАК ДатаОплаты,
	|		ВТ_СводныеДанные.Комментарий КАК Комментарий,
	|		ВТ_СводныеДанные.ЧислоОплатыАренды КАК ЧислоОплатыАренды,
	|		ВТ_СводныеДанные.СрокОплатыАренды КАК СрокОплатыАренды,
	|		ВТ_СводныеДанные.СтатусОплаты КАК СтатусОплаты,
	|		ВТ_СводныеДанные.ТипАренднойПлаты КАК ТипАренднойПлаты,
	|		ВТ_СводныеДанные.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|		ВТ_СводныеДанные.ЭтоХвостОплаты КАК ЭтоХвостОплаты,
	|		МАКСИМУМ(КурсыВалютДляРасчетовПоАренде.Период) КАК Период
	|	ИЗ
	|		ВТ_СводныеДанные КАК ВТ_СводныеДанные
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовПоАренде КАК КурсыВалютДляРасчетовПоАренде
	|			ПО ВТ_СводныеДанные.ДоговорКонтрагента = КурсыВалютДляРасчетовПоАренде.ДоговорКонтрагента
	|				И (КурсыВалютДляРасчетовПоАренде.Период <= ВТ_СводныеДанные.ДатаОплаты)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_СводныеДанные.Организация,
	|		ВТ_СводныеДанные.Контрагент,
	|		ВТ_СводныеДанные.ДоговорКонтрагента,
	|		ВТ_СводныеДанные.СтавкаНДС,
	|		ВТ_СводныеДанные.СтруктурнаяЕдиница,
	|		ВТ_СводныеДанные.ДатаНачалаАренды,
	|		ВТ_СводныеДанные.ДатаОкончанияАренды,
	|		ВТ_СводныеДанные.ДатаАктаЗаключения,
	|		ВТ_СводныеДанные.ДатаОплаты,
	|		ВТ_СводныеДанные.Комментарий,
	|		ВТ_СводныеДанные.СтатусОплаты,
	|		ВТ_СводныеДанные.ТипАренднойПлаты,
	|		ВТ_СводныеДанные.ПлатежныйДокумент,
	|		ВТ_СводныеДанные.ЭтоХвостОплаты,
	|		ВТ_СводныеДанные.СрокОплатыАренды,
	|		ВТ_СводныеДанные.СуммаПланБезналичные,
	|		ВТ_СводныеДанные.СуммаПланБезналичныеВал,
	|		ВТ_СводныеДанные.СуммаПланНаличные,
	|		ВТ_СводныеДанные.СуммаПланНаличныеВал,
	|		ВТ_СводныеДанные.ЧислоОплатыАренды) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовПоАренде КАК КурсыВалютДляРасчетовПоАренде
	|		ПО ВложенныйЗапрос.ДоговорКонтрагента = КурсыВалютДляРасчетовПоАренде.ДоговорКонтрагента
	|			И ВложенныйЗапрос.Период = КурсыВалютДляРасчетовПоАренде.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.ДоговорКонтрагента,
	|	ВложенныйЗапрос.ТипАренднойПлаты
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПроизводственныйКалендарь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Статусы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Договоры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СводныеДанные";
	
	Возврат Запрос.Выполнить();
	
	
	
КонецФункции

Функция ПолучитьРезультатТаблицуСтарыйВариант() Экспорт 
	
	РезультатЗапроса = ПолучитьРезультатЗапросаСтарыйВариант();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьРезультатВыборкуСтарыйВариант() Экспорт 
	
	РезультатЗапроса = ПолучитьРезультатЗапросаСтарыйВариант();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции	

мВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
